# Sakila Core

## Sakila's Model
![png](Data/sakila-db-model.png)

## SQL Alchemy and Pandas Prep

In [6]:
# imports
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [7]:
# user and pass
username = 'root'
password = 'root'

In [8]:
# accessing mysql workbench in sakila db
connection = f'mysql+pymysql://{username}:{password}@localhost/sakila'
engine = create_engine(connection)

In [9]:
# running engine
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [10]:
# showing the tables in sakila
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

# 1. What query would you run to get all the customers inside city_id = 312?  Your query should return the customers' first name, last name, email, address, and city.

In [23]:
q1 = '''
SELECT
    c.city,
    a.address, 
    cust.first_name,
    cust.last_name,
    cust.email
FROM
    city c
JOIN 
    address a ON c.city_id = a.city_id
JOIN 
    customer cust ON a.address_id = cust.address_id
WHERE
    c.city_id = 312
'''

pd.read_sql(q1,engine)

,city,address,first_name,last_name,email
0,London,1497 Yuzhou Drive,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org
1,London,548 Uruapan Street,CECIL,VINES,CECIL.VINES@sakilacustomer.org

# 2. What query would you run to get all comedy films? Note that the genre is called the category in this schema.  Your query should return film title, description, release year, rating, and special features.

In [25]:
q2 = '''
SELECT
	c.name,
	f.title,
    f.description,
    f.release_year,
    f.rating,
    f.special_features
FROM
	film f
JOIN
	film_category fc ON f.film_id = fc.film_id
JOIN
	category c ON fc.category_id = c.category_id
WHERE
	c.name = 'Comedy'
'''

pd.read_sql(q2,engine).head()

,name,title,description,release_year,rating,special_features
0,Comedy,AIRPLANE SIERRA,A Touching Saga of a Hunter And a Butler who m...,2006,PG-13,"Trailers,Deleted Scenes"
1,Comedy,ANTHEM LUKE,A Touching Panorama of a Waitress And a Woman ...,2006,PG-13,"Deleted Scenes,Behind the Scenes"
2,Comedy,BRINGING HYSTERICAL,A Fateful Saga of a A Shark And a Technical Wr...,2006,PG,Trailers
3,Comedy,CAPER MOTIONS,A Fateful Saga of a Moose And a Car who must P...,2006,G,"Trailers,Commentaries,Deleted Scenes"
4,Comedy,CAT CONEHEADS,A Fast-Paced Panorama of a Girl And a A Shark ...,2006,G,"Commentaries,Deleted Scenes"